// Эта строка является комментарием и она будет проигнорирована компилятором
// Протестировать код можно нажав на кнопку "Run" вот тут ->
// так же можно использовать клавиатуру, нажав сочетание клавиш "Ctrl + Enter"

// Этот код можно редактировать не стесняясь, дерзайте!
// Всегда можно вернуть оригинальный код, нажав на кнопку "Reset" вот тут ->

// Это главная функция. С неё начинается исполнение любой программы
fn main() {
    // Следующий код будет исполнен в момент, когда будет запущен исполняемый файл

    // Отображаем текст в консоли
    println!("Привет, мир!");
}
